parameterStudy/test_cases/of_cylinder2D_binary/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         15;

deltaT          1e-3; //5e-4

writeControl    runTime;

writeInterval   5e-3; //0.025

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

functions
{
	#include "FOvorticity"
}
// ************************************************************************* //
